# Задача со страницы 15: Вывести фразу три раза
phrase = "Я стану крутым программистом!"
print(phrase)
print(phrase)
print(phrase)

print("\n" + "="*50 + "\n")

# Задача со страницы 16: Повторение буквы
letter = input("Введите букву: ")
n = int(input("Введите число n: "))
result = letter * n
print(result)

print("\n" + "="*50 + "\n")

# Задача со страницы 17: Вывод цитаты
print('Лев Николаевич Толстой написал "Война и мир"')

print("\n" + "="*50 + "\n")

# Задача со страницы 18: Две фразы в той же последовательности
phrase1 = input("Введите первую фразу: ")
phrase2 = input("Введите вторую фразу: ")
print(phrase1)
print(phrase2)

print("\n" + "="*50 + "\n")

# Задача со страницы 19: Три фразы в обратной последовательности
phrase1 = input("Введите первую фразу: ")
phrase2 = input("Введите вторую фразу: ")
phrase3 = input("Введите третью фразу: ")
print(phrase3)
print(phrase2)
print(phrase1)

print("\n" + "="*50 + "\n")

# Задача со страницы 20: Слово четыре раза с пробелами
word = input("Введите слово: ")
result = (word + " ") * 4
print(result.strip())

print("\n" + "="*50 + "\n")

# Задача со страницы 39: Первый символ строки
text = input("Введите строку: ")
print(text[0])

print("\n" + "="*50 + "\n")

# Задача со страницы 40: Последний символ строки
text = input("Введите строку: ")
print(text[-1])

print("\n" + "="*50 + "\n")

# Задача со страницы 41: Первые 4 символа
text = input("Введите строку (не менее 4 символов): ")
print(text[:4])

print("\n" + "="*50 + "\n")

# Задача со страницы 42: Последние 4 символа
text = input("Введите строку (не менее 4 символов): ")
print(text[-4:])

print("\n" + "="*50 + "\n")

# Задача со страницы 53: Преобразовать в заглавные
text = input("Введите строку: ")
print(text.upper())

print("\n" + "="*50 + "\n")

# Задача со страницы 54: Преобразовать в строчные
text = input("Введите строку: ")
print(text.lower())

print("\n" + "="*50 + "\n")

# Задача со страницы 55: Сравнение строк без учета регистра (исправленная)
str1 = input("Введите первую строку: ")
str2 = input("Введите вторую строку: ")
print(str1.lower() == str2.lower())

print("\n" + "="*50 + "\n")

# Задача со страницы 56: Форматирование строки (первые и последние 3 символа заглавные)
text = input("Введите строку (не менее 6 символов): ")
if len(text) >= 6:
    first_three = text[:3].upper()
    middle = text[3:-3].lower()
    last_three = text[-3:].upper()
    result = first_three + middle + last_three
    print(result)
else:
    print("Строка должна содержать не менее 6 символов")

print("\n" + "="*50 + "\n")

# Задача со страницы 64: Индекс первой латинской буквы 'a'
text = input("Введите строку: ")
if 'a' in text:
    print(text.find('a'))
else:
    print(-1)

print("\n" + "="*50 + "\n")

# Задача со страницы 67: Замена пробелов на запятые
text = input("Введите фразу: ")
result = text.replace(' ', ',')
print(result)